GopalSaraf/Practicals/PSDL/include/proc/pic18lf258.inc
// Register: RXM0EIDH
#define RXM0EIDH RXM0EIDH
RXM0EIDH                                 equ 0F1Ah
// bitfield definitions
RXM0EIDH_EID8_POSN                       equ 0000h
RXM0EIDH_EID8_POSITION                   equ 0000h
RXM0EIDH_EID8_SIZE                       equ 0001h
RXM0EIDH_EID8_LENGTH                     equ 0001h
RXM0EIDH_EID8_MASK                       equ 0001h
RXM0EIDH_EID9_POSN                       equ 0001h
RXM0EIDH_EID9_POSITION                   equ 0001h
RXM0EIDH_EID9_SIZE                       equ 0001h
RXM0EIDH_EID9_LENGTH                     equ 0001h
RXM0EIDH_EID9_MASK                       equ 0002h
RXM0EIDH_EID10_POSN                      equ 0002h
RXM0EIDH_EID10_POSITION                  equ 0002h
RXM0EIDH_EID10_SIZE                      equ 0001h
RXM0EIDH_EID10_LENGTH                    equ 0001h
RXM0EIDH_EID10_MASK                      equ 0004h
RXM0EIDH_EID11_POSN                      equ 0003h
RXM0EIDH_EID11_POSITION                  equ 0003h
RXM0EIDH_EID11_SIZE                      equ 0001h
RXM0EIDH_EID11_LENGTH                    equ 0001h
RXM0EIDH_EID11_MASK                      equ 0008h
RXM0EIDH_EID12_POSN                      equ 0004h
RXM0EIDH_EID12_POSITION                  equ 0004h
RXM0EIDH_EID12_SIZE                      equ 0001h
RXM0EIDH_EID12_LENGTH                    equ 0001h
RXM0EIDH_EID12_MASK                      equ 0010h
RXM0EIDH_EID13_POSN                      equ 0005h
RXM0EIDH_EID13_POSITION                  equ 0005h
RXM0EIDH_EID13_SIZE                      equ 0001h
RXM0EIDH_EID13_LENGTH                    equ 0001h
RXM0EIDH_EID13_MASK                      equ 0020h
RXM0EIDH_EID14_POSN                      equ 0006h
RXM0EIDH_EID14_POSITION                  equ 0006h
RXM0EIDH_EID14_SIZE                      equ 0001h
RXM0EIDH_EID14_LENGTH                    equ 0001h
RXM0EIDH_EID14_MASK                      equ 0040h
RXM0EIDH_EID15_POSN                      equ 0007h
RXM0EIDH_EID15_POSITION                  equ 0007h
RXM0EIDH_EID15_SIZE                      equ 0001h
RXM0EIDH_EID15_LENGTH                    equ 0001h
RXM0EIDH_EID15_MASK                      equ 0080h
RXM0EIDH_RXM0EID8_POSN                   equ 0000h
RXM0EIDH_RXM0EID8_POSITION               equ 0000h
RXM0EIDH_RXM0EID8_SIZE                   equ 0001h
RXM0EIDH_RXM0EID8_LENGTH                 equ 0001h
RXM0EIDH_RXM0EID8_MASK                   equ 0001h
RXM0EIDH_RXM0EID9_POSN                   equ 0001h
RXM0EIDH_RXM0EID9_POSITION               equ 0001h
RXM0EIDH_RXM0EID9_SIZE                   equ 0001h
RXM0EIDH_RXM0EID9_LENGTH                 equ 0001h
RXM0EIDH_RXM0EID9_MASK                   equ 0002h
RXM0EIDH_RXM0EID10_POSN                  equ 0002h
RXM0EIDH_RXM0EID10_POSITION              equ 0002h
RXM0EIDH_RXM0EID10_SIZE                  equ 0001h
RXM0EIDH_RXM0EID10_LENGTH                equ 0001h
RXM0EIDH_RXM0EID10_MASK                  equ 0004h
RXM0EIDH_RXM0EID11_POSN                  equ 0003h
RXM0EIDH_RXM0EID11_POSITION              equ 0003h
RXM0EIDH_RXM0EID11_SIZE                  equ 0001h
RXM0EIDH_RXM0EID11_LENGTH                equ 0001h
RXM0EIDH_RXM0EID11_MASK                  equ 0008h
RXM0EIDH_RXM0EID12_POSN                  equ 0004h
RXM0EIDH_RXM0EID12_POSITION              equ 0004h
RXM0EIDH_RXM0EID12_SIZE                  equ 0001h
RXM0EIDH_RXM0EID12_LENGTH                equ 0001h
RXM0EIDH_RXM0EID12_MASK                  equ 0010h
RXM0EIDH_RXM0EID13_POSN                  equ 0005h
RXM0EIDH_RXM0EID13_POSITION              equ 0005h
RXM0EIDH_RXM0EID13_SIZE                  equ 0001h
RXM0EIDH_RXM0EID13_LENGTH                equ 0001h
RXM0EIDH_RXM0EID13_MASK                  equ 0020h
RXM0EIDH_RXM0EID14_POSN                  equ 0006h
RXM0EIDH_RXM0EID14_POSITION              equ 0006h
RXM0EIDH_RXM0EID14_SIZE                  equ 0001h
RXM0EIDH_RXM0EID14_LENGTH                equ 0001h
RXM0EIDH_RXM0EID14_MASK                  equ 0040h
RXM0EIDH_RXM0EID15_POSN                  equ 0007h
RXM0EIDH_RXM0EID15_POSITION              equ 0007h
RXM0EIDH_RXM0EID15_SIZE                  equ 0001h
RXM0EIDH_RXM0EID15_LENGTH                equ 0001h
RXM0EIDH_RXM0EID15_MASK                  equ 0080h

// Register: RXM0EIDL
#define RXM0EIDL RXM0EIDL
RXM0EIDL                                 equ 0F1Bh
// bitfield definitions
RXM0EIDL_EID0_POSN                       equ 0000h
RXM0EIDL_EID0_POSITION                   equ 0000h
RXM0EIDL_EID0_SIZE                       equ 0001h
RXM0EIDL_EID0_LENGTH                     equ 0001h
RXM0EIDL_EID0_MASK                       equ 0001h
RXM0EIDL_EID1_POSN                       equ 0001h
RXM0EIDL_EID1_POSITION                   equ 0001h
RXM0EIDL_EID1_SIZE                       equ 0001h
RXM0EIDL_EID1_LENGTH                     equ 0001h
RXM0EIDL_EID1_MASK                       equ 0002h
RXM0EIDL_EID2_POSN                       equ 0002h
RXM0EIDL_EID2_POSITION                   equ 0002h
RXM0EIDL_EID2_SIZE                       equ 0001h
RXM0EIDL_EID2_LENGTH                     equ 0001h
RXM0EIDL_EID2_MASK                       equ 0004h
RXM0EIDL_EID3_POSN                       equ 0003h
RXM0EIDL_EID3_POSITION                   equ 0003h
RXM0EIDL_EID3_SIZE                       equ 0001h
RXM0EIDL_EID3_LENGTH                     equ 0001h
RXM0EIDL_EID3_MASK                       equ 0008h
RXM0EIDL_EID4_POSN                       equ 0004h
RXM0EIDL_EID4_POSITION                   equ 0004h
RXM0EIDL_EID4_SIZE                       equ 0001h
RXM0EIDL_EID4_LENGTH                     equ 0001h
RXM0EIDL_EID4_MASK                       equ 0010h
RXM0EIDL_EID5_POSN                       equ 0005h
RXM0EIDL_EID5_POSITION                   equ 0005h
RXM0EIDL_EID5_SIZE                       equ 0001h
RXM0EIDL_EID5_LENGTH                     equ 0001h
RXM0EIDL_EID5_MASK                       equ 0020h
RXM0EIDL_EID6_POSN                       equ 0006h
RXM0EIDL_EID6_POSITION                   equ 0006h
RXM0EIDL_EID6_SIZE                       equ 0001h
RXM0EIDL_EID6_LENGTH                     equ 0001h
RXM0EIDL_EID6_MASK                       equ 0040h
RXM0EIDL_EID7_POSN                       equ 0007h
RXM0EIDL_EID7_POSITION                   equ 0007h
RXM0EIDL_EID7_SIZE                       equ 0001h
RXM0EIDL_EID7_LENGTH                     equ 0001h
RXM0EIDL_EID7_MASK                       equ 0080h
RXM0EIDL_RXM0EID0_POSN                   equ 0000h
RXM0EIDL_RXM0EID0_POSITION               equ 0000h
RXM0EIDL_RXM0EID0_SIZE                   equ 0001h
RXM0EIDL_RXM0EID0_LENGTH                 equ 0001h
RXM0EIDL_RXM0EID0_MASK                   equ 0001h
RXM0EIDL_RXM0EID1_POSN                   equ 0001h
RXM0EIDL_RXM0EID1_POSITION               equ 0001h
RXM0EIDL_RXM0EID1_SIZE                   equ 0001h
RXM0EIDL_RXM0EID1_LENGTH                 equ 0001h
RXM0EIDL_RXM0EID1_MASK                   equ 0002h
RXM0EIDL_RXM0EID2_POSN                   equ 0002h
RXM0EIDL_RXM0EID2_POSITION               equ 0002h
RXM0EIDL_RXM0EID2_SIZE                   equ 0001h
RXM0EIDL_RXM0EID2_LENGTH                 equ 0001h
RXM0EIDL_RXM0EID2_MASK                   equ 0004h
RXM0EIDL_RXM0EID3_POSN                   equ 0003h
RXM0EIDL_RXM0EID3_POSITION               equ 0003h
RXM0EIDL_RXM0EID3_SIZE                   equ 0001h
RXM0EIDL_RXM0EID3_LENGTH                 equ 0001h
RXM0EIDL_RXM0EID3_MASK                   equ 0008h
RXM0EIDL_RXM0EID4_POSN                   equ 0004h
RXM0EIDL_RXM0EID4_POSITION               equ 0004h
RXM0EIDL_RXM0EID4_SIZE                   equ 0001h
RXM0EIDL_RXM0EID4_LENGTH                 equ 0001h
RXM0EIDL_RXM0EID4_MASK                   equ 0010h
RXM0EIDL_RXM0EID5_POSN                   equ 0005h
RXM0EIDL_RXM0EID5_POSITION               equ 0005h
RXM0EIDL_RXM0EID5_SIZE                   equ 0001h
RXM0EIDL_RXM0EID5_LENGTH                 equ 0001h
RXM0EIDL_RXM0EID5_MASK                   equ 0020h
RXM0EIDL_RXM0EID6_POSN                   equ 0006h
RXM0EIDL_RXM0EID6_POSITION               equ 0006h
RXM0EIDL_RXM0EID6_SIZE                   equ 0001h
RXM0EIDL_RXM0EID6_LENGTH                 equ 0001h
RXM0EIDL_RXM0EID6_MASK                   equ 0040h
RXM0EIDL_RXM0EID7_POSN                   equ 0007h
RXM0EIDL_RXM0EID7_POSITION               equ 0007h
RXM0EIDL_RXM0EID7_SIZE                   equ 0001h
RXM0EIDL_RXM0EID7_LENGTH                 equ 0001h
RXM0EIDL_RXM0EID7_MASK                   equ 0080h

// Register: RXM1SIDH
#define RXM1SIDH RXM1SIDH
RXM1SIDH                                 equ 0F1Ch
// bitfield definitions
RXM1SIDH_SID3_POSN                       equ 0000h
RXM1SIDH_SID3_POSITION                   equ 0000h
RXM1SIDH_SID3_SIZE                       equ 0001h
RXM1SIDH_SID3_LENGTH                     equ 0001h
RXM1SIDH_SID3_MASK                       equ 0001h
RXM1SIDH_SID4_POSN                       equ 0001h
RXM1SIDH_SID4_POSITION                   equ 0001h
RXM1SIDH_SID4_SIZE                       equ 0001h
RXM1SIDH_SID4_LENGTH                     equ 0001h
RXM1SIDH_SID4_MASK                       equ 0002h
RXM1SIDH_SID5_POSN                       equ 0002h
RXM1SIDH_SID5_POSITION                   equ 0002h
RXM1SIDH_SID5_SIZE                       equ 0001h
RXM1SIDH_SID5_LENGTH                     equ 0001h
RXM1SIDH_SID5_MASK                       equ 0004h
RXM1SIDH_SID6_POSN                       equ 0003h
RXM1SIDH_SID6_POSITION                   equ 0003h
RXM1SIDH_SID6_SIZE                       equ 0001h
RXM1SIDH_SID6_LENGTH                     equ 0001h
RXM1SIDH_SID6_MASK                       equ 0008h
RXM1SIDH_SID7_POSN                       equ 0004h
RXM1SIDH_SID7_POSITION                   equ 0004h
RXM1SIDH_SID7_SIZE                       equ 0001h
RXM1SIDH_SID7_LENGTH                     equ 0001h
RXM1SIDH_SID7_MASK                       equ 0010h
RXM1SIDH_SID8_POSN                       equ 0005h
RXM1SIDH_SID8_POSITION                   equ 0005h
RXM1SIDH_SID8_SIZE                       equ 0001h
RXM1SIDH_SID8_LENGTH                     equ 0001h
RXM1SIDH_SID8_MASK                       equ 0020h
RXM1SIDH_SID9_POSN                       equ 0006h
RXM1SIDH_SID9_POSITION                   equ 0006h
RXM1SIDH_SID9_SIZE                       equ 0001h
RXM1SIDH_SID9_LENGTH                     equ 0001h
RXM1SIDH_SID9_MASK                       equ 0040h
RXM1SIDH_SID10_POSN                      equ 0007h
RXM1SIDH_SID10_POSITION                  equ 0007h
RXM1SIDH_SID10_SIZE                      equ 0001h
RXM1SIDH_SID10_LENGTH                    equ 0001h
RXM1SIDH_SID10_MASK                      equ 0080h
RXM1SIDH_RXM1SID3_POSN                   equ 0000h
RXM1SIDH_RXM1SID3_POSITION               equ 0000h
RXM1SIDH_RXM1SID3_SIZE                   equ 0001h
RXM1SIDH_RXM1SID3_LENGTH                 equ 0001h
RXM1SIDH_RXM1SID3_MASK                   equ 0001h
RXM1SIDH_RXM1SID4_POSN                   equ 0001h
RXM1SIDH_RXM1SID4_POSITION               equ 0001h
RXM1SIDH_RXM1SID4_SIZE                   equ 0001h
RXM1SIDH_RXM1SID4_LENGTH                 equ 0001h
RXM1SIDH_RXM1SID4_MASK                   equ 0002h
RXM1SIDH_RXM1SID5_POSN                   equ 0002h
RXM1SIDH_RXM1SID5_POSITION               equ 0002h
RXM1SIDH_RXM1SID5_SIZE                   equ 0001h
RXM1SIDH_RXM1SID5_LENGTH                 equ 0001h
RXM1SIDH_RXM1SID5_MASK                   equ 0004h
RXM1SIDH_RXM1SID6_POSN                   equ 0003h
RXM1SIDH_RXM1SID6_POSITION               equ 0003h
RXM1SIDH_RXM1SID6_SIZE                   equ 0001h
RXM1SIDH_RXM1SID6_LENGTH                 equ 0001h
RXM1SIDH_RXM1SID6_MASK                   equ 0008h
RXM1SIDH_RXM1SID7_POSN                   equ 0004h
RXM1SIDH_RXM1SID7_POSITION               equ 0004h
RXM1SIDH_RXM1SID7_SIZE                   equ 0001h
RXM1SIDH_RXM1SID7_LENGTH                 equ 0001h
RXM1SIDH_RXM1SID7_MASK                   equ 0010h
RXM1SIDH_RXM1SID8_POSN                   equ 0005h
RXM1SIDH_RXM1SID8_POSITION               equ 0005h
RXM1SIDH_RXM1SID8_SIZE                   equ 0001h
RXM1SIDH_RXM1SID8_LENGTH                 equ 0001h
RXM1SIDH_RXM1SID8_MASK                   equ 0020h
RXM1SIDH_RXM1SID9_POSN                   equ 0006h
RXM1SIDH_RXM1SID9_POSITION               equ 0006h
RXM1SIDH_RXM1SID9_SIZE                   equ 0001h
RXM1SIDH_RXM1SID9_LENGTH                 equ 0001h
RXM1SIDH_RXM1SID9_MASK                   equ 0040h
RXM1SIDH_RXM1SID10_POSN                  equ 0007h
RXM1SIDH_RXM1SID10_POSITION              equ 0007h
RXM1SIDH_RXM1SID10_SIZE                  equ 0001h
RXM1SIDH_RXM1SID10_LENGTH                equ 0001h
RXM1SIDH_RXM1SID10_MASK                  equ 0080h

// Register: RXM1SIDL
#define RXM1SIDL RXM1SIDL
RXM1SIDL                                 equ 0F1Dh
// bitfield definitions
RXM1SIDL_EID16_POSN                      equ 0000h
RXM1SIDL_EID16_POSITION                  equ 0000h
RXM1SIDL_EID16_SIZE                      equ 0001h
RXM1SIDL_EID16_LENGTH                    equ 0001h
RXM1SIDL_EID16_MASK                      equ 0001h
RXM1SIDL_EID17_POSN                      equ 0001h
RXM1SIDL_EID17_POSITION                  equ 0001h
RXM1SIDL_EID17_SIZE                      equ 0001h
RXM1SIDL_EID17_LENGTH                    equ 0001h
RXM1SIDL_EID17_MASK                      equ 0002h
RXM1SIDL_SID0_POSN                       equ 0005h
RXM1SIDL_SID0_POSITION                   equ 0005h
RXM1SIDL_SID0_SIZE                       equ 0001h
RXM1SIDL_SID0_LENGTH                     equ 0001h
RXM1SIDL_SID0_MASK                       equ 0020h
RXM1SIDL_SID1_POSN                       equ 0006h
RXM1SIDL_SID1_POSITION                   equ 0006h
RXM1SIDL_SID1_SIZE                       equ 0001h
RXM1SIDL_SID1_LENGTH                     equ 0001h
RXM1SIDL_SID1_MASK                       equ 0040h
RXM1SIDL_SID2_POSN                       equ 0007h
RXM1SIDL_SID2_POSITION                   equ 0007h
RXM1SIDL_SID2_SIZE                       equ 0001h
RXM1SIDL_SID2_LENGTH                     equ 0001h
RXM1SIDL_SID2_MASK                       equ 0080h
RXM1SIDL_RXM1EID16_POSN                  equ 0000h
RXM1SIDL_RXM1EID16_POSITION              equ 0000h
RXM1SIDL_RXM1EID16_SIZE                  equ 0001h
RXM1SIDL_RXM1EID16_LENGTH                equ 0001h
RXM1SIDL_RXM1EID16_MASK                  equ 0001h
RXM1SIDL_RXM1EID17_POSN                  equ 0001h
RXM1SIDL_RXM1EID17_POSITION              equ 0001h
RXM1SIDL_RXM1EID17_SIZE                  equ 0001h
RXM1SIDL_RXM1EID17_LENGTH                equ 0001h
RXM1SIDL_RXM1EID17_MASK                  equ 0002h
RXM1SIDL_RXM1SID0_POSN                   equ 0005h
RXM1SIDL_RXM1SID0_POSITION               equ 0005h
RXM1SIDL_RXM1SID0_SIZE                   equ 0001h
RXM1SIDL_RXM1SID0_LENGTH                 equ 0001h
RXM1SIDL_RXM1SID0_MASK                   equ 0020h
RXM1SIDL_RXM1SID1_POSN                   equ 0006h
RXM1SIDL_RXM1SID1_POSITION               equ 0006h
RXM1SIDL_RXM1SID1_SIZE                   equ 0001h
RXM1SIDL_RXM1SID1_LENGTH                 equ 0001h
RXM1SIDL_RXM1SID1_MASK                   equ 0040h
RXM1SIDL_RXM1SID2_POSN                   equ 0007h
RXM1SIDL_RXM1SID2_POSITION               equ 0007h
RXM1SIDL_RXM1SID2_SIZE                   equ 0001h
RXM1SIDL_RXM1SID2_LENGTH                 equ 0001h
RXM1SIDL_RXM1SID2_MASK                   equ 0080h

