GopalSaraf/Practicals/PSDL/include/proc/pic18lf258.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_STKPTR0_POSN                      equ 0000h
STKPTR_STKPTR0_POSITION                  equ 0000h
STKPTR_STKPTR0_SIZE                      equ 0001h
STKPTR_STKPTR0_LENGTH                    equ 0001h
STKPTR_STKPTR0_MASK                      equ 0001h
STKPTR_STKPTR1_POSN                      equ 0001h
STKPTR_STKPTR1_POSITION                  equ 0001h
STKPTR_STKPTR1_SIZE                      equ 0001h
STKPTR_STKPTR1_LENGTH                    equ 0001h
STKPTR_STKPTR1_MASK                      equ 0002h
STKPTR_STKPTR2_POSN                      equ 0002h
STKPTR_STKPTR2_POSITION                  equ 0002h
STKPTR_STKPTR2_SIZE                      equ 0001h
STKPTR_STKPTR2_LENGTH                    equ 0001h
STKPTR_STKPTR2_MASK                      equ 0004h
STKPTR_STKPTR3_POSN                      equ 0003h
STKPTR_STKPTR3_POSITION                  equ 0003h
STKPTR_STKPTR3_SIZE                      equ 0001h
STKPTR_STKPTR3_LENGTH                    equ 0001h
STKPTR_STKPTR3_MASK                      equ 0008h
STKPTR_STKPTR4_POSN                      equ 0004h
STKPTR_STKPTR4_POSITION                  equ 0004h
STKPTR_STKPTR4_SIZE                      equ 0001h
STKPTR_STKPTR4_LENGTH                    equ 0001h
STKPTR_STKPTR4_MASK                      equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABAT                             BANKMASK(CANCON), 4, a
#define ACKDT                            BANKMASK(SSPCON2), 5, a
#define ACKEN                            BANKMASK(SSPCON2), 4, a
#define ACKSTAT                          BANKMASK(SSPCON2), 6, a
#define ADCAL                            BANKMASK(ADCON0), 7, a
#define ADCS0                            BANKMASK(ADCON0), 6, a
#define ADCS1                            BANKMASK(ADCON0), 7, a
#define ADCS2                            BANKMASK(ADCON1), 6, a
#define ADDEN                            BANKMASK(RCSTA), 3, a
#define ADFM                             BANKMASK(ADCON1), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 5, a
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BF                               BANKMASK(SSPSTAT), 0, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRGH                             BANKMASK(TXSTA), 2, a
#define BRGH1                            BANKMASK(TXSTA), 2, a
#define BRP0                             BANKMASK(BRGCON1), 0, a
#define BRP1                             BANKMASK(BRGCON1), 1, a
#define BRP2                             BANKMASK(BRGCON1), 2, a
#define BRP3                             BANKMASK(BRGCON1), 3, a
#define BRP4                             BANKMASK(BRGCON1), 4, a
#define BRP5                             BANKMASK(BRGCON1), 5, a
#define CANCAP                           BANKMASK(CIOCON), 4, a
#define CANRX                            BANKMASK(PORTB), 3, a
#define CANTX                            BANKMASK(PORTB), 2, a
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCP1                             BANKMASK(PORTC), 2, a
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP1X                            BANKMASK(CCP1CON), 5, a
#define CCP1Y                            BANKMASK(CCP1CON), 4, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CFGS                             BANKMASK(EECON1), 6, a
#define CHS0                             BANKMASK(ADCON0), 3, a
#define CHS1                             BANKMASK(ADCON0), 4, a
#define CHS2                             BANKMASK(ADCON0), 5, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK                               BANKMASK(PORTC), 6, a
#define CKE                              BANKMASK(SSPSTAT), 6, a
#define CKP                              BANKMASK(SSPCON1), 4, a
#define CLKO                             BANKMASK(PORTA), 6, a
#define CREN                             BANKMASK(RCSTA), 4, a
#define CSRC                             BANKMASK(TXSTA), 7, a
#define CSRC1                            BANKMASK(TXSTA), 7, a
#define CVREF                            BANKMASK(PORTA), 0, a
#define DA                               BANKMASK(SSPSTAT), 5, a
#define DATA_ADDRESS                     BANKMASK(SSPSTAT), 5, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DONE                             BANKMASK(ADCON0), 2, a
#define DT                               BANKMASK(PORTC), 7, a
#define D_A                              BANKMASK(SSPSTAT), 5, a
#define D_NOT_A                          BANKMASK(SSPSTAT), 5, a
#define D_nA                             BANKMASK(SSPSTAT), 5, a
#define EBDIS                            BANKMASK(PR2), 7, a
#define EEFS                             BANKMASK(EECON1), 6, a
#define EEIE                             BANKMASK(PIE2), 4, a
#define EEIF                             BANKMASK(PIR2), 4, a
#define EEIP                             BANKMASK(IPR2), 4, a
#define EEPGD                            BANKMASK(EECON1), 7, a
#define EICODE1                          BANKMASK(CANSTAT), 1, a
#define EICODE2                          BANKMASK(CANSTAT), 2, a
#define EICODE3                          BANKMASK(CANSTAT), 3, a
#define ENDRHI                           BANKMASK(CIOCON), 5, a
#define ERRIE                            BANKMASK(PIE3), 5, a
#define ERRIF                            BANKMASK(PIR3), 5, a
#define ERRIP                            BANKMASK(IPR3), 5, a
#define EWARN                            BANKMASK(COMSTAT), 0, a
#define FERR                             BANKMASK(RCSTA), 2, a
#define FIFOEMPTY                        BANKMASK(COMSTAT), 7, a
#define FILHIT1                          BANKMASK(RXB1CON), 1, b
#define FILHIT2                          BANKMASK(RXB1CON), 2, b
#define FP1                              BANKMASK(CANCON), 1, a
#define FP2                              BANKMASK(CANCON), 2, a
#define FP3                              BANKMASK(CANCON), 3, a
#define FREE                             BANKMASK(EECON1), 4, a
#define GCEN                             BANKMASK(SSPCON2), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 2, a
#define GODONE                           BANKMASK(ADCON0), 2, a
#define GO_DONE                          BANKMASK(ADCON0), 2, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 2, a
#define GO_nDONE                         BANKMASK(ADCON0), 2, a
#define I2C_DAT                          BANKMASK(SSPSTAT), 5, a
#define I2C_DATA                         BANKMASK(SSPSTAT), 5, a
#define I2C_READ                         BANKMASK(SSPSTAT), 2, a
#define I2C_START                        BANKMASK(SSPSTAT), 3, a
#define I2C_STOP                         BANKMASK(SSPSTAT), 4, a
#define INT0                             BANKMASK(PORTB), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTB), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define IPEN                             BANKMASK(RCON), 7, a
#define IRVST                            BANKMASK(LVDCON), 5, a
#define IRXIE                            BANKMASK(PIE3), 7, a
#define IRXIF                            BANKMASK(PIR3), 7, a
#define IRXIP                            BANKMASK(IPR3), 7, a
#define IVRE                             BANKMASK(PIE3), 7, a
#define IVRF                             BANKMASK(PIR3), 7, a
#define IVRP                             BANKMASK(IPR3), 7, a
#define IVRST                            BANKMASK(LVDCON), 5, a
#define JTOFF                            BANKMASK(RXB0CON), 1, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LVDEN                            BANKMASK(LVDCON), 4, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define LVDL0                            BANKMASK(LVDCON), 0, a
#define LVDL1                            BANKMASK(LVDCON), 1, a
#define LVDL2                            BANKMASK(LVDCON), 2, a
#define LVDL3                            BANKMASK(LVDCON), 3, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSPSTAT), 5, a
#define NOT_ADDRESS                      BANKMASK(SSPSTAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_DONE                         BANKMASK(ADCON0), 2, a
#define NOT_IPEN                         BANKMASK(RCON), 7, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RC8                          BANKMASK(RCSTA), 6, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_SS                           BANKMASK(PORTA), 5, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_TX8                          BANKMASK(TXSTA), 6, a
#define NOT_W                            BANKMASK(SSPSTAT), 2, a
#define NOT_WRITE                        BANKMASK(SSPSTAT), 2, a
#define OERR                             BANKMASK(RCSTA), 1, a
#define OSC2                             BANKMASK(PORTA), 6, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PCFG0                            BANKMASK(ADCON1), 0, a
#define PCFG1                            BANKMASK(ADCON1), 1, a
#define PCFG2                            BANKMASK(ADCON1), 2, a
#define PCFG3                            BANKMASK(ADCON1), 3, a
#define PD                               BANKMASK(RCON), 2, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN                              BANKMASK(SSPCON2), 2, a
#define PGC                              BANKMASK(PORTB), 6, a
#define PGD                              BANKMASK(PORTB), 7, a
#define PGM                              BANKMASK(PORTB), 5, a
#define POR                              BANKMASK(RCON), 1, a
#define PRSEG0                           BANKMASK(BRGCON2), 0, a
#define PRSEG1                           BANKMASK(BRGCON2), 1, a
#define PRSEG2                           BANKMASK(BRGCON2), 2, a
#define PSA                              BANKMASK(T0CON), 3, a
#define RB0D00                           BANKMASK(RXB0D0), 0, a
#define RB0D01                           BANKMASK(RXB0D0), 1, a
#define RB0D02                           BANKMASK(RXB0D0), 2, a
#define RB0D03                           BANKMASK(RXB0D0), 3, a
#define RB0D04                           BANKMASK(RXB0D0), 4, a
#define RB0D05                           BANKMASK(RXB0D0), 5, a
#define RB0D06                           BANKMASK(RXB0D0), 6, a
#define RB0D07                           BANKMASK(RXB0D0), 7, a
#define RB0D10                           BANKMASK(RXB0D1), 0, a
#define RB0D11                           BANKMASK(RXB0D1), 1, a
#define RB0D12                           BANKMASK(RXB0D1), 2, a
#define RB0D13                           BANKMASK(RXB0D1), 3, a
#define RB0D14                           BANKMASK(RXB0D1), 4, a
#define RB0D15                           BANKMASK(RXB0D1), 5, a
#define RB0D16                           BANKMASK(RXB0D1), 6, a
#define RB0D17                           BANKMASK(RXB0D1), 7, a
#define RB0D20                           BANKMASK(RXB0D2), 0, a
#define RB0D21                           BANKMASK(RXB0D2), 1, a
#define RB0D22                           BANKMASK(RXB0D2), 2, a
#define RB0D23                           BANKMASK(RXB0D2), 3, a
#define RB0D24                           BANKMASK(RXB0D2), 4, a
#define RB0D25                           BANKMASK(RXB0D2), 5, a
#define RB0D26                           BANKMASK(RXB0D2), 6, a
#define RB0D27                           BANKMASK(RXB0D2), 7, a
#define RB0D30                           BANKMASK(RXB0D3), 0, a
#define RB0D31                           BANKMASK(RXB0D3), 1, a
#define RB0D32                           BANKMASK(RXB0D3), 2, a
#define RB0D33                           BANKMASK(RXB0D3), 3, a
#define RB0D34                           BANKMASK(RXB0D3), 4, a
#define RB0D35                           BANKMASK(RXB0D3), 5, a
#define RB0D36                           BANKMASK(RXB0D3), 6, a
#define RB0D37                           BANKMASK(RXB0D3), 7, a
#define RB0D40                           BANKMASK(RXB0D4), 0, a
#define RB0D41                           BANKMASK(RXB0D4), 1, a
#define RB0D42                           BANKMASK(RXB0D4), 2, a
#define RB0D43                           BANKMASK(RXB0D4), 3, a
#define RB0D44                           BANKMASK(RXB0D4), 4, a
#define RB0D45                           BANKMASK(RXB0D4), 5, a
#define RB0D46                           BANKMASK(RXB0D4), 6, a
#define RB0D47                           BANKMASK(RXB0D4), 7, a
#define RB0D50                           BANKMASK(RXB0D5), 0, a
#define RB0D51                           BANKMASK(RXB0D5), 1, a
#define RB0D52                           BANKMASK(RXB0D5), 2, a
#define RB0D53                           BANKMASK(RXB0D5), 3, a
#define RB0D54                           BANKMASK(RXB0D5), 4, a
#define RB0D55                           BANKMASK(RXB0D5), 5, a
#define RB0D56                           BANKMASK(RXB0D5), 6, a
#define RB0D57                           BANKMASK(RXB0D5), 7, a
#define RB0D60                           BANKMASK(RXB0D6), 0, a
#define RB0D61                           BANKMASK(RXB0D6), 1, a
#define RB0D62                           BANKMASK(RXB0D6), 2, a
#define RB0D63                           BANKMASK(RXB0D6), 3, a
#define RB0D64                           BANKMASK(RXB0D6), 4, a
#define RB0D65                           BANKMASK(RXB0D6), 5, a
#define RB0D66                           BANKMASK(RXB0D6), 6, a
#define RB0D67                           BANKMASK(RXB0D6), 7, a
#define RB0D70                           BANKMASK(RXB0D7), 0, a
#define RB0D71                           BANKMASK(RXB0D7), 1, a
#define RB0D72                           BANKMASK(RXB0D7), 2, a
#define RB0D73                           BANKMASK(RXB0D7), 3, a
#define RB0D74                           BANKMASK(RXB0D7), 4, a
#define RB0D75                           BANKMASK(RXB0D7), 5, a
#define RB0D76                           BANKMASK(RXB0D7), 6, a
#define RB0D77                           BANKMASK(RXB0D7), 7, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC8_9                            BANKMASK(RCSTA), 6, a
#define RC9                              BANKMASK(RCSTA), 6, a
