GopalSaraf/Practicals/PSDL/include/proc/pic18lf258.inc
#define RCD8                             BANKMASK(RCSTA), 0, a
#define RCEN                             BANKMASK(SSPCON2), 3, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RD                               BANKMASK(EECON1), 0, a
#define RD163                            BANKMASK(T3CON), 7, a
#define READ_WRITE                       BANKMASK(SSPSTAT), 2, a
#define REC0                             BANKMASK(RXERRCNT), 0, a
#define REC1                             BANKMASK(RXERRCNT), 1, a
#define REC2                             BANKMASK(RXERRCNT), 2, a
#define REC3                             BANKMASK(RXERRCNT), 3, a
#define REC4                             BANKMASK(RXERRCNT), 4, a
#define REC5                             BANKMASK(RXERRCNT), 5, a
#define REC6                             BANKMASK(RXERRCNT), 6, a
#define REC7                             BANKMASK(RXERRCNT), 7, a
#define REQOP0                           BANKMASK(CANCON), 5, a
#define REQOP1                           BANKMASK(CANCON), 6, a
#define REQOP2                           BANKMASK(CANCON), 7, a
#define RI                               BANKMASK(RCON), 4, a
#define RSEN                             BANKMASK(SSPCON2), 1, a
#define RW                               BANKMASK(SSPSTAT), 2, a
#define RX                               BANKMASK(PORTC), 7, a
#define RX0IE                            BANKMASK(PIE3), 0, a
#define RX0IF                            BANKMASK(PIR3), 0, a
#define RX1IE                            BANKMASK(PIE3), 1, a
#define RX1IF                            BANKMASK(PIR3), 1, a
#define RX1OVFL                          BANKMASK(COMSTAT), 7, a
#define RX2OVFL                          BANKMASK(COMSTAT), 6, a
#define RX9                              BANKMASK(RCSTA), 6, a
#define RX9D                             BANKMASK(RCSTA), 0, a
#define RXB0D00                          BANKMASK(RXB0D0), 0, a
#define RXB0D01                          BANKMASK(RXB0D0), 1, a
#define RXB0D02                          BANKMASK(RXB0D0), 2, a
#define RXB0D03                          BANKMASK(RXB0D0), 3, a
#define RXB0D04                          BANKMASK(RXB0D0), 4, a
#define RXB0D05                          BANKMASK(RXB0D0), 5, a
#define RXB0D06                          BANKMASK(RXB0D0), 6, a
#define RXB0D07                          BANKMASK(RXB0D0), 7, a
#define RXB0D10                          BANKMASK(RXB0D1), 0, a
#define RXB0D11                          BANKMASK(RXB0D1), 1, a
#define RXB0D12                          BANKMASK(RXB0D1), 2, a
#define RXB0D13                          BANKMASK(RXB0D1), 3, a
#define RXB0D14                          BANKMASK(RXB0D1), 4, a
#define RXB0D15                          BANKMASK(RXB0D1), 5, a
#define RXB0D16                          BANKMASK(RXB0D1), 6, a
#define RXB0D17                          BANKMASK(RXB0D1), 7, a
#define RXB0D20                          BANKMASK(RXB0D2), 0, a
#define RXB0D21                          BANKMASK(RXB0D2), 1, a
#define RXB0D22                          BANKMASK(RXB0D2), 2, a
#define RXB0D23                          BANKMASK(RXB0D2), 3, a
#define RXB0D24                          BANKMASK(RXB0D2), 4, a
#define RXB0D25                          BANKMASK(RXB0D2), 5, a
#define RXB0D26                          BANKMASK(RXB0D2), 6, a
#define RXB0D27                          BANKMASK(RXB0D2), 7, a
#define RXB0D30                          BANKMASK(RXB0D3), 0, a
#define RXB0D31                          BANKMASK(RXB0D3), 1, a
#define RXB0D32                          BANKMASK(RXB0D3), 2, a
#define RXB0D33                          BANKMASK(RXB0D3), 3, a
#define RXB0D34                          BANKMASK(RXB0D3), 4, a
#define RXB0D35                          BANKMASK(RXB0D3), 5, a
#define RXB0D36                          BANKMASK(RXB0D3), 6, a
#define RXB0D37                          BANKMASK(RXB0D3), 7, a
#define RXB0D40                          BANKMASK(RXB0D4), 0, a
#define RXB0D41                          BANKMASK(RXB0D4), 1, a
#define RXB0D42                          BANKMASK(RXB0D4), 2, a
#define RXB0D43                          BANKMASK(RXB0D4), 3, a
#define RXB0D44                          BANKMASK(RXB0D4), 4, a
#define RXB0D45                          BANKMASK(RXB0D4), 5, a
#define RXB0D46                          BANKMASK(RXB0D4), 6, a
#define RXB0D47                          BANKMASK(RXB0D4), 7, a
#define RXB0D50                          BANKMASK(RXB0D5), 0, a
#define RXB0D51                          BANKMASK(RXB0D5), 1, a
#define RXB0D52                          BANKMASK(RXB0D5), 2, a
#define RXB0D53                          BANKMASK(RXB0D5), 3, a
#define RXB0D54                          BANKMASK(RXB0D5), 4, a
#define RXB0D55                          BANKMASK(RXB0D5), 5, a
#define RXB0D56                          BANKMASK(RXB0D5), 6, a
#define RXB0D57                          BANKMASK(RXB0D5), 7, a
#define RXB0D60                          BANKMASK(RXB0D6), 0, a
#define RXB0D61                          BANKMASK(RXB0D6), 1, a
#define RXB0D62                          BANKMASK(RXB0D6), 2, a
#define RXB0D63                          BANKMASK(RXB0D6), 3, a
#define RXB0D64                          BANKMASK(RXB0D6), 4, a
#define RXB0D65                          BANKMASK(RXB0D6), 5, a
#define RXB0D66                          BANKMASK(RXB0D6), 6, a
#define RXB0D67                          BANKMASK(RXB0D6), 7, a
#define RXB0D70                          BANKMASK(RXB0D7), 0, a
#define RXB0D71                          BANKMASK(RXB0D7), 1, a
#define RXB0D72                          BANKMASK(RXB0D7), 2, a
#define RXB0D73                          BANKMASK(RXB0D7), 3, a
#define RXB0D74                          BANKMASK(RXB0D7), 4, a
#define RXB0D75                          BANKMASK(RXB0D7), 5, a
#define RXB0D76                          BANKMASK(RXB0D7), 6, a
#define RXB0D77                          BANKMASK(RXB0D7), 7, a
#define RXB0DBEN                         BANKMASK(RXB0CON), 2, a
#define RXB0DLC0                         BANKMASK(RXB0DLC), 0, a
#define RXB0DLC1                         BANKMASK(RXB0DLC), 1, a
#define RXB0DLC2                         BANKMASK(RXB0DLC), 2, a
#define RXB0DLC3                         BANKMASK(RXB0DLC), 3, a
#define RXB0EID0                         BANKMASK(RXB0EIDL), 0, a
#define RXB0EID1                         BANKMASK(RXB0EIDL), 1, a
#define RXB0EID10                        BANKMASK(RXB0EIDH), 2, a
#define RXB0EID11                        BANKMASK(RXB0EIDH), 3, a
#define RXB0EID12                        BANKMASK(RXB0EIDH), 4, a
#define RXB0EID13                        BANKMASK(RXB0EIDH), 5, a
#define RXB0EID14                        BANKMASK(RXB0EIDH), 6, a
#define RXB0EID15                        BANKMASK(RXB0EIDH), 7, a
#define RXB0EID16                        BANKMASK(RXB0SIDL), 0, a
#define RXB0EID17                        BANKMASK(RXB0SIDL), 1, a
#define RXB0EID2                         BANKMASK(RXB0EIDL), 2, a
#define RXB0EID3                         BANKMASK(RXB0EIDL), 3, a
#define RXB0EID4                         BANKMASK(RXB0EIDL), 4, a
#define RXB0EID5                         BANKMASK(RXB0EIDL), 5, a
#define RXB0EID6                         BANKMASK(RXB0EIDL), 6, a
#define RXB0EID7                         BANKMASK(RXB0EIDL), 7, a
#define RXB0EID8                         BANKMASK(RXB0EIDH), 0, a
#define RXB0EID9                         BANKMASK(RXB0EIDH), 1, a
#define RXB0EXID                         BANKMASK(RXB0SIDL), 3, a
#define RXB0FILHIT0                      BANKMASK(RXB0CON), 0, a
#define RXB0FILHIT1                      BANKMASK(RXB0CON), 1, a
#define RXB0FILHIT2                      BANKMASK(RXB0CON), 2, a
#define RXB0FILHIT3                      BANKMASK(RXB0CON), 3, a
#define RXB0FUL                          BANKMASK(RXB0CON), 7, a
#define RXB0IE                           BANKMASK(PIE3), 0, a
#define RXB0IF                           BANKMASK(PIR3), 0, a
#define RXB0IP                           BANKMASK(IPR3), 0, a
#define RXB0M0                           BANKMASK(RXB0CON), 5, a
#define RXB0M1                           BANKMASK(RXB0CON), 6, a
#define RXB0OVFL                         BANKMASK(COMSTAT), 7, a
#define RXB0RB0                          BANKMASK(RXB0DLC), 4, a
#define RXB0RB1                          BANKMASK(RXB0DLC), 5, a
#define RXB0RTR                          BANKMASK(RXB0DLC), 6, a
#define RXB0RTRR0                        BANKMASK(RXB0CON), 3, a
#define RXB0RTRRO                        BANKMASK(RXB0CON), 5, a
#define RXB0SID0                         BANKMASK(RXB0SIDL), 5, a
#define RXB0SID1                         BANKMASK(RXB0SIDL), 6, a
#define RXB0SID10                        BANKMASK(RXB0SIDH), 7, a
#define RXB0SID2                         BANKMASK(RXB0SIDL), 7, a
#define RXB0SID3                         BANKMASK(RXB0SIDH), 0, a
#define RXB0SID4                         BANKMASK(RXB0SIDH), 1, a
#define RXB0SID5                         BANKMASK(RXB0SIDH), 2, a
#define RXB0SID6                         BANKMASK(RXB0SIDH), 3, a
#define RXB0SID7                         BANKMASK(RXB0SIDH), 4, a
#define RXB0SID8                         BANKMASK(RXB0SIDH), 5, a
#define RXB0SID9                         BANKMASK(RXB0SIDH), 6, a
#define RXB0SRR                          BANKMASK(RXB0SIDL), 4, a
#define RXB1D00                          BANKMASK(RXB1D0), 0, b
#define RXB1D01                          BANKMASK(RXB1D0), 1, b
#define RXB1D02                          BANKMASK(RXB1D0), 2, b
#define RXB1D03                          BANKMASK(RXB1D0), 3, b
#define RXB1D04                          BANKMASK(RXB1D0), 4, b
#define RXB1D05                          BANKMASK(RXB1D0), 5, b
#define RXB1D06                          BANKMASK(RXB1D0), 6, b
#define RXB1D07                          BANKMASK(RXB1D0), 7, b
#define RXB1D10                          BANKMASK(RXB1D1), 0, b
#define RXB1D11                          BANKMASK(RXB1D1), 1, b
#define RXB1D12                          BANKMASK(RXB1D1), 2, b
#define RXB1D13                          BANKMASK(RXB1D1), 3, b
#define RXB1D14                          BANKMASK(RXB1D1), 4, b
#define RXB1D15                          BANKMASK(RXB1D1), 5, b
#define RXB1D16                          BANKMASK(RXB1D1), 6, b
#define RXB1D17                          BANKMASK(RXB1D1), 7, b
#define RXB1D20                          BANKMASK(RXB1D2), 0, b
#define RXB1D21                          BANKMASK(RXB1D2), 1, b
#define RXB1D22                          BANKMASK(RXB1D2), 2, b
#define RXB1D23                          BANKMASK(RXB1D2), 3, b
#define RXB1D24                          BANKMASK(RXB1D2), 4, b
#define RXB1D25                          BANKMASK(RXB1D2), 5, b
#define RXB1D26                          BANKMASK(RXB1D2), 6, b
#define RXB1D27                          BANKMASK(RXB1D2), 7, b
#define RXB1D30                          BANKMASK(RXB1D3), 0, b
#define RXB1D31                          BANKMASK(RXB1D3), 1, b
#define RXB1D32                          BANKMASK(RXB1D3), 2, b
#define RXB1D33                          BANKMASK(RXB1D3), 3, b
#define RXB1D34                          BANKMASK(RXB1D3), 4, b
#define RXB1D35                          BANKMASK(RXB1D3), 5, b
#define RXB1D36                          BANKMASK(RXB1D3), 6, b
#define RXB1D37                          BANKMASK(RXB1D3), 7, b
#define RXB1D40                          BANKMASK(RXB1D4), 0, b
#define RXB1D41                          BANKMASK(RXB1D4), 1, b
#define RXB1D42                          BANKMASK(RXB1D4), 2, b
#define RXB1D43                          BANKMASK(RXB1D4), 3, b
#define RXB1D44                          BANKMASK(RXB1D4), 4, b
#define RXB1D45                          BANKMASK(RXB1D4), 5, b
#define RXB1D46                          BANKMASK(RXB1D4), 6, b
#define RXB1D47                          BANKMASK(RXB1D4), 7, b
#define RXB1D50                          BANKMASK(RXB1D5), 0, b
#define RXB1D51                          BANKMASK(RXB1D5), 1, b
#define RXB1D52                          BANKMASK(RXB1D5), 2, b
#define RXB1D53                          BANKMASK(RXB1D5), 3, b
#define RXB1D54                          BANKMASK(RXB1D5), 4, b
#define RXB1D55                          BANKMASK(RXB1D5), 5, b
#define RXB1D56                          BANKMASK(RXB1D5), 6, b
#define RXB1D57                          BANKMASK(RXB1D5), 7, b
#define RXB1D60                          BANKMASK(RXB1D6), 0, b
#define RXB1D61                          BANKMASK(RXB1D6), 1, b
#define RXB1D62                          BANKMASK(RXB1D6), 2, b
#define RXB1D63                          BANKMASK(RXB1D6), 3, b
#define RXB1D64                          BANKMASK(RXB1D6), 4, b
#define RXB1D65                          BANKMASK(RXB1D6), 5, b
#define RXB1D66                          BANKMASK(RXB1D6), 6, b
#define RXB1D67                          BANKMASK(RXB1D6), 7, b
#define RXB1D70                          BANKMASK(RXB1D7), 0, b
#define RXB1D71                          BANKMASK(RXB1D7), 1, b
#define RXB1D72                          BANKMASK(RXB1D7), 2, b
#define RXB1D73                          BANKMASK(RXB1D7), 3, b
#define RXB1D74                          BANKMASK(RXB1D7), 4, b
#define RXB1D75                          BANKMASK(RXB1D7), 5, b
#define RXB1D76                          BANKMASK(RXB1D7), 6, b
#define RXB1D77                          BANKMASK(RXB1D7), 7, b
#define RXB1DLC0                         BANKMASK(RXB1DLC), 0, b
#define RXB1DLC1                         BANKMASK(RXB1DLC), 1, b
#define RXB1DLC2                         BANKMASK(RXB1DLC), 2, b
#define RXB1DLC3                         BANKMASK(RXB1DLC), 3, b
#define RXB1EID0                         BANKMASK(RXB1EIDL), 0, b
#define RXB1EID1                         BANKMASK(RXB1EIDL), 1, b
#define RXB1EID10                        BANKMASK(RXB1EIDH), 2, b
#define RXB1EID11                        BANKMASK(RXB1EIDH), 3, b
#define RXB1EID12                        BANKMASK(RXB1EIDH), 4, b
#define RXB1EID13                        BANKMASK(RXB1EIDH), 5, b
#define RXB1EID14                        BANKMASK(RXB1EIDH), 6, b
#define RXB1EID15                        BANKMASK(RXB1EIDH), 7, b
#define RXB1EID16                        BANKMASK(RXB1SIDL), 0, b
#define RXB1EID17                        BANKMASK(RXB1SIDL), 1, b
#define RXB1EID2                         BANKMASK(RXB1EIDL), 2, b
#define RXB1EID3                         BANKMASK(RXB1EIDL), 3, b
#define RXB1EID4                         BANKMASK(RXB1EIDL), 4, b
#define RXB1EID5                         BANKMASK(RXB1EIDL), 5, b
#define RXB1EID6                         BANKMASK(RXB1EIDL), 6, b
#define RXB1EID7                         BANKMASK(RXB1EIDL), 7, b
#define RXB1EID8                         BANKMASK(RXB1EIDH), 0, b
#define RXB1EID9                         BANKMASK(RXB1EIDH), 1, b
#define RXB1EXID                         BANKMASK(RXB1SIDL), 3, b
#define RXB1FILHIT0                      BANKMASK(RXB1CON), 0, b
#define RXB1FILHIT1                      BANKMASK(RXB1CON), 1, b
#define RXB1FILHIT2                      BANKMASK(RXB1CON), 2, b
#define RXB1FILHIT3                      BANKMASK(RXB1CON), 3, b
#define RXB1FUL                          BANKMASK(RXB1CON), 7, b
#define RXB1IE                           BANKMASK(PIE3), 1, a
#define RXB1IF                           BANKMASK(PIR3), 1, a
#define RXB1IP                           BANKMASK(IPR3), 1, a
#define RXB1M0                           BANKMASK(RXB1CON), 5, b
#define RXB1M1                           BANKMASK(RXB1CON), 6, b
#define RXB1OVFL                         BANKMASK(COMSTAT), 6, a
#define RXB1RB0                          BANKMASK(RXB1DLC), 4, b
#define RXB1RB1                          BANKMASK(RXB1DLC), 5, b
#define RXB1RTR                          BANKMASK(RXB1DLC), 6, b
#define RXB1RTRR0                        BANKMASK(RXB1CON), 3, b
#define RXB1RTRRO                        BANKMASK(RXB1CON), 5, b
#define RXB1SID0                         BANKMASK(RXB1SIDL), 5, b
#define RXB1SID1                         BANKMASK(RXB1SIDL), 6, b
#define RXB1SID10                        BANKMASK(RXB1SIDH), 7, b
#define RXB1SID2                         BANKMASK(RXB1SIDL), 7, b
#define RXB1SID3                         BANKMASK(RXB1SIDH), 0, b
#define RXB1SID4                         BANKMASK(RXB1SIDH), 1, b
#define RXB1SID5                         BANKMASK(RXB1SIDH), 2, b
#define RXB1SID6                         BANKMASK(RXB1SIDH), 3, b
#define RXB1SID7                         BANKMASK(RXB1SIDH), 4, b
#define RXB1SID8                         BANKMASK(RXB1SIDH), 5, b
#define RXB1SID9                         BANKMASK(RXB1SIDH), 6, b
#define RXB1SRR                          BANKMASK(RXB1SIDL), 4, b
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXBNOVFL                         BANKMASK(COMSTAT), 6, a
#define RXBP                             BANKMASK(COMSTAT), 3, a
#define RXF0EID0                         BANKMASK(RXF0EIDL), 0, b
#define RXF0EID1                         BANKMASK(RXF0EIDL), 1, b
#define RXF0EID10                        BANKMASK(RXF0EIDH), 2, b
#define RXF0EID11                        BANKMASK(RXF0EIDH), 3, b
#define RXF0EID12                        BANKMASK(RXF0EIDH), 4, b
#define RXF0EID13                        BANKMASK(RXF0EIDH), 5, b
#define RXF0EID14                        BANKMASK(RXF0EIDH), 6, b
#define RXF0EID15                        BANKMASK(RXF0EIDH), 7, b
#define RXF0EID16                        BANKMASK(RXF0SIDL), 0, b
#define RXF0EID17                        BANKMASK(RXF0SIDL), 1, b
#define RXF0EID2                         BANKMASK(RXF0EIDL), 2, b
#define RXF0EID3                         BANKMASK(RXF0EIDL), 3, b
#define RXF0EID4                         BANKMASK(RXF0EIDL), 4, b
#define RXF0EID5                         BANKMASK(RXF0EIDL), 5, b
#define RXF0EID6                         BANKMASK(RXF0EIDL), 6, b
#define RXF0EID7                         BANKMASK(RXF0EIDL), 7, b
#define RXF0EID8                         BANKMASK(RXF0EIDH), 0, b
#define RXF0EID9                         BANKMASK(RXF0EIDH), 1, b
#define RXF0EXIDEN                       BANKMASK(RXF0SIDL), 3, b
#define RXF0SID0                         BANKMASK(RXF0SIDL), 5, b
#define RXF0SID1                         BANKMASK(RXF0SIDL), 6, b
#define RXF0SID10                        BANKMASK(RXF0SIDH), 7, b
#define RXF0SID2                         BANKMASK(RXF0SIDL), 7, b
#define RXF0SID3                         BANKMASK(RXF0SIDH), 0, b
#define RXF0SID4                         BANKMASK(RXF0SIDH), 1, b
#define RXF0SID5                         BANKMASK(RXF0SIDH), 2, b
#define RXF0SID6                         BANKMASK(RXF0SIDH), 3, b
#define RXF0SID7                         BANKMASK(RXF0SIDH), 4, b
#define RXF0SID8                         BANKMASK(RXF0SIDH), 5, b
#define RXF0SID9                         BANKMASK(RXF0SIDH), 6, b
#define RXF1EID0                         BANKMASK(RXF1EIDL), 0, b
#define RXF1EID1                         BANKMASK(RXF1EIDL), 1, b
#define RXF1EID10                        BANKMASK(RXF1EIDH), 2, b
#define RXF1EID11                        BANKMASK(RXF1EIDH), 3, b
#define RXF1EID12                        BANKMASK(RXF1EIDH), 4, b
#define RXF1EID13                        BANKMASK(RXF1EIDH), 5, b
#define RXF1EID14                        BANKMASK(RXF1EIDH), 6, b
#define RXF1EID15                        BANKMASK(RXF1EIDH), 7, b
#define RXF1EID16                        BANKMASK(RXF1SIDL), 0, b
#define RXF1EID17                        BANKMASK(RXF1SIDL), 1, b
#define RXF1EID2                         BANKMASK(RXF1EIDL), 2, b
#define RXF1EID3                         BANKMASK(RXF1EIDL), 3, b
#define RXF1EID4                         BANKMASK(RXF1EIDL), 4, b
#define RXF1EID5                         BANKMASK(RXF1EIDL), 5, b
#define RXF1EID6                         BANKMASK(RXF1EIDL), 6, b
#define RXF1EID7                         BANKMASK(RXF1EIDL), 7, b
#define RXF1EID8                         BANKMASK(RXF1EIDH), 0, b
#define RXF1EID9                         BANKMASK(RXF1EIDH), 1, b
#define RXF1EXIDEN                       BANKMASK(RXF1SIDL), 3, b
#define RXF1SID0                         BANKMASK(RXF1SIDL), 5, b
#define RXF1SID1                         BANKMASK(RXF1SIDL), 6, b
#define RXF1SID10                        BANKMASK(RXF1SIDH), 7, b
#define RXF1SID2                         BANKMASK(RXF1SIDL), 7, b
#define RXF1SID3                         BANKMASK(RXF1SIDH), 0, b
#define RXF1SID4                         BANKMASK(RXF1SIDH), 1, b
#define RXF1SID5                         BANKMASK(RXF1SIDH), 2, b
#define RXF1SID6                         BANKMASK(RXF1SIDH), 3, b
#define RXF1SID7                         BANKMASK(RXF1SIDH), 4, b
#define RXF1SID8                         BANKMASK(RXF1SIDH), 5, b
#define RXF1SID9                         BANKMASK(RXF1SIDH), 6, b
#define RXF2EID0                         BANKMASK(RXF2EIDL), 0, b
#define RXF2EID1                         BANKMASK(RXF2EIDL), 1, b
#define RXF2EID10                        BANKMASK(RXF2EIDH), 2, b
#define RXF2EID11                        BANKMASK(RXF2EIDH), 3, b
#define RXF2EID12                        BANKMASK(RXF2EIDH), 4, b
#define RXF2EID13                        BANKMASK(RXF2EIDH), 5, b
#define RXF2EID14                        BANKMASK(RXF2EIDH), 6, b
#define RXF2EID15                        BANKMASK(RXF2EIDH), 7, b
#define RXF2EID16                        BANKMASK(RXF2SIDL), 0, b
#define RXF2EID17                        BANKMASK(RXF2SIDL), 1, b
#define RXF2EID2                         BANKMASK(RXF2EIDL), 2, b
#define RXF2EID3                         BANKMASK(RXF2EIDL), 3, b
#define RXF2EID4                         BANKMASK(RXF2EIDL), 4, b
#define RXF2EID5                         BANKMASK(RXF2EIDL), 5, b
#define RXF2EID6                         BANKMASK(RXF2EIDL), 6, b
#define RXF2EID7                         BANKMASK(RXF2EIDL), 7, b
#define RXF2EID8                         BANKMASK(RXF2EIDH), 0, b
#define RXF2EID9                         BANKMASK(RXF2EIDH), 1, b
#define RXF2EXIDEN                       BANKMASK(RXF2SIDL), 3, b
#define RXF2SID0                         BANKMASK(RXF2SIDL), 5, b
#define RXF2SID1                         BANKMASK(RXF2SIDL), 6, b
#define RXF2SID10                        BANKMASK(RXF2SIDH), 7, b
#define RXF2SID2                         BANKMASK(RXF2SIDL), 7, b
#define RXF2SID3                         BANKMASK(RXF2SIDH), 0, b
#define RXF2SID4                         BANKMASK(RXF2SIDH), 1, b
#define RXF2SID5                         BANKMASK(RXF2SIDH), 2, b
#define RXF2SID6                         BANKMASK(RXF2SIDH), 3, b
#define RXF2SID7                         BANKMASK(RXF2SIDH), 4, b
#define RXF2SID8                         BANKMASK(RXF2SIDH), 5, b
#define RXF2SID9                         BANKMASK(RXF2SIDH), 6, b
#define RXF3EID0                         BANKMASK(RXF3EIDL), 0, b
#define RXF3EID1                         BANKMASK(RXF3EIDL), 1, b
#define RXF3EID10                        BANKMASK(RXF3EIDH), 2, b
#define RXF3EID11                        BANKMASK(RXF3EIDH), 3, b
#define RXF3EID12                        BANKMASK(RXF3EIDH), 4, b
#define RXF3EID13                        BANKMASK(RXF3EIDH), 5, b
#define RXF3EID14                        BANKMASK(RXF3EIDH), 6, b
#define RXF3EID15                        BANKMASK(RXF3EIDH), 7, b
#define RXF3EID16                        BANKMASK(RXF3SIDL), 0, b
#define RXF3EID17                        BANKMASK(RXF3SIDL), 1, b
#define RXF3EID2                         BANKMASK(RXF3EIDL), 2, b
#define RXF3EID3                         BANKMASK(RXF3EIDL), 3, b
